// Дефинирайте функция за итериране на елементите на списъка, която приема указател към друга
// функция, подадена от клиента, която извършва желаните операции на всеки отделен елемент от списъка.
// void my_list_iterate(my_list ls, void (*iterFunc)(char*));
// Функцията за итериране трябва да извиква подадената й като аргумент функция за всеки елемент на
// списъка.

void my_list_iterate(my_list ls, void (*iterFunc)(char *))
{
    for (size_t i = 0; i < ls.elementsCount; i++)
    {
        (*iterFunc)(ls.data[i]);
    }
}