// Добавете функционалност за еднократно гласуване за книга от потребител (рейтинг от 0 до 5).
// Добавете функционалност, която следи общия средноаритметичен рейтинг на всички книги в библиотеката. Добавете интефрейс за
// обновяването му при всяко еднократно гласуване и интерфейс за бърз достъп до него. За да бъде бърз този достъп за четене, не би
// следвало на всяко негово извикване да се обхожда и изчислява по скоро можем да върнем кеширана стойност, която се обновява
// много по рядко, само при нужда при единично гласуване от потребител.
// Къде ще живее тази кеширана променлива?
// Би могла да е член данна на manager class(тепърва ще видим как да ограничим броя обекти от даден тип на един и не повече).
// Би могла и да е член данна на BookInfo класа. С цел упражнение, нека изберем второто за момента.